import random

first_Names = ['Александр', 'Дмитрий', 'Максим', 'Сергей', 'Андрей', 'Алексей', 'Артём', 'Илья', 'Кирилл',
                'Михаил', 'Никита', 'Матвей', 'Роман', 'Егор', 'Арсений', 'Иван', 'Денис', 'Евгений', 'Даниил',
                'Тимофей', 'Владислав', 'Игорь', 'Владимир', 'Павел', 'Руслан', 'Марк', 'Константин', 'Тимур',
                'Олег', 'Ярослав', 'Антон', 'Николай', 'Глеб', 'Данил', 'Савелий', 'Вадим', 'Степан', 'Юрий',
                'Богдан', 'Артур', 'Семен', 'Макар', 'Лев', 'Виктор', 'Елисей', 'Виталий', 'Вячеслав', 'Захар',
                'Мирон', 'Дамир', 'Георгий', 'Давид', 'Платон', 'Анатолий', 'Григорий', 'Демид', 'Данил',
                'Станислав', 'Василий', 'Федор', 'Родион', 'Леонид', 'Одиссей', 'Валерий', 'Святослав',
                'Борис', 'Эдуард', 'Марат', 'Герман', 'Петр']
last_Names = ['Иванов', 'Смирнов', 'Кузнецов', 'Попов', 'Васильев', 'Петров', 'Соколов', 'Михайлов',
                'Новиков', 'Федоров', 'Морозов', 'Волков', 'Алексеев', 'Лебедев', 'Семенов', 'Егоров',
                'Павлов', 'Козлов', 'Степанов', 'Николаев', 'Орлов', 'Андреев', 'Макаров', 'Никитин',
                'Захаров', 'Зайцев', 'Соловьев', 'Борисов', 'Яковлев', 'Григорьев', 'Романов', 'Воробьев',
                'Сергеев', 'Кузьмин', 'Фролов', 'Александров', 'Дмитриев', 'Королев', 'Гусев', 'Киселев',
                'Ильин', 'Максимов', 'Поляков', 'Сорокин', 'Виноградов', 'Ковалев', 'Белов', 'Медведев',
                'Антонов', 'Тарасов', 'Жуков', 'Баранов', 'Филиппов', 'Комаров', 'Давыдов', 'Беляев',
                'Герасимов', 'Богданов', 'Осипов', 'Сидоров', 'Матвеев', 'Титов', 'Марков', 'Миронов',
                'Крылов', 'Куликов', 'Карпов', 'Власов', 'Мельников']
pauls = ['Арсеньевич', 'Артёмович', 'Артемьевич', 'Артурович', 'Архипович', 'Давидович',
            'Давыдович', 'Даниилович', 'Данилович', 'Демидович', 'Магомедович', 'Магометович',
            'Макарович', 'Максимилианович', 'Максимович', 'Олегович', 'Осипович', 'Семёнович',
            'Сергеевич', 'Сидорович']
birthdays = ['1994-09-14', '2003-04-21', '1996-06-25', '2008-11-02', '2001-05-11',
                '1993-12-08', '2005-03-17', '1999-08-29', '2007-01-10', '1995-04-04',
                '2000-10-15', '1997-07-19', '2006-02-26', '2009-09-07', '2002-06-30',
                '1991-11-03', '1998-12-20', '2004-08-11', '1992-01-23', '2003-10-14',
                '2006-03-05', '1995-09-28', '2008-12-18', '1993-05-22', '2001-04-06',
                '1997-11-30', '1999-02-13', '2007-07-24', '2004-01-16', '1992-09-04',
                '2005-10-08', '1996-03-21', '2002-11-12', '1994-06-03', '2000-07-28',
                '1998-05-15', '2009-02-27', '1993-07-05', '2001-12-19', '1996-10-01',
                '1995-08-12', '2007-06-09', '2002-03-23', '1999-12-02', '1997-04-08',
                '2006-11-26', '2004-04-30', '2000-02-07', '1992-05-19', '1998-10-27']
emails = ['Xi67VYW@gmail.com', 'URb5rg4@gmail.com', 'U1jSmK4@gmail.com', '9da6yMW@gmail.com', 'A3vNa9s@gmail.com',
          '9KtKn5X@gmail.com', 'j2iqA9Z@gmail.com', 'O7nbWP3@gmail.com', 'MKN2S9n@gmail.com', 'J6jjiU5@gmail.com',
          '2vLfTG6@gmail.com', 'hG3PVu4@gmail.com', '36ifvRd@gmail.com', 'ukNsD58@gmail.com', 'Sl2gb0G@gmail.com',
          'lQXdc92@gmail.com', '3E5tsSS@gmail.com', 'y9v1dfz@gmail.com', 'oIXBY51@gmail.com', 'H0m2vlm@gmail.com']
telephones = random_numbers = ''.join(str(random.randint(0, 9)) for _ in range(10))
citys = ["Москва", "Санкт-Петербург", "Новосибирск", "Екатеринбург", "Нижний Новгород", "Казань", "Челябинск", "Омск",
         "Самара", "Ростов-на-Дону", "Уфа", "Волгоград", "Красноярск", "Пермь", "Воронеж", "Тюмень", "Саратов",
         "Краснодар", "Тольятти", "Ижевск", "Барнаул", "Ульяновск", "Ярославль", "Иркутск", "Кемерово", "Хабаровск",
         "Набережные Челны", "Рязань", "Тверь", "Калуга"]
countrys = ['Россия']

def generating():
    print(''' 
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⡾⠿⢿⡀⠀⠀⠀⠀⣠⣶⣿⣷⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣦⣴⣿⡋⠀⠀⠈⢳⡄⠀⢠⣾⣿⠁⠈⣿⡆⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⠿⠛⠉⠉⠁⠀⠀⠀⠹⡄⣿⣿⣿⠀⠀⢹⡇⠀⠀⠀
⠀⠀⠀⠀⠀⣠⣾⡿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⣰⣏⢻⣿⣿⡆⠀⠸⣿⠀⠀⠀
⠀⠀⠀⢀⣴⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣆⠹⣿⣷⠀⢘⣿⠀⠀⠀
⠀⠀⢀⡾⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⠋⠉⠛⠂⠹⠿⣲⣿⣿⣧⠀⠀
⠀⢠⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣿⣿⣿⣷⣾⣿⡇⢀⠀⣼⣿⣿⣿⣧⠀                        
⠰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⡘⢿⣿⣿⣿⠀                         
⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⣷⡈⠿⢿⣿⡆                        
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠛⠁⢙⠛⣿⣿⣿⣿⡟⠀⡿⠀⠀⢀⣿⡇                        
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣶⣤⣉⣛⠻⠇⢠⣿⣾⣿⡄⢻⡇          
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣦⣤⣾⣿⣿⣿⣿⣆⠁
⠀⠀⠀⠀''')
    print("Сгенерированная личность: ")
    print('[+] Пол: Мужской')
    print('[+] Имя: ', random.choice(first_Names))
    print('[+] Фамилия: ', random.choice(last_Names))
    print('[+] Отчество: ', random.choice(pauls))
    print('[+] Дата рождения: ', random.choice(birthdays))
    print('[+] Email: ', random.choice(emails))
    print('[+] Номер телефона: ', '7' + telephones)
    print('[+] Город: ', random.choice(citys))
    print('[+] Страна: ', random.choice(countrys))
    return