name = """
                                ██████╗░░█████╗░██████╗░███████╗██╗░░██╗
                                ██╔══██╗██╔══██╗██╔══██╗██╔════╝╚██╗██╔╝
                                ██║░░██║██║░░██║██████╔╝█████╗░░░╚███╔╝░
                                ██║░░██║██║░░██║██╔══██╗██╔══╝░░░██╔██╗░
                                ██████╔╝╚█████╔╝██║░░██║███████╗██╔╝╚██╗
                                ╚═════╝░░╚════╝░╚═╝░░╚═╝╚══════╝╚═╝░░╚═╝ ᵛ1.1
                             Телеграм канал проекта: https://t.me/DorexSoftware
———————————————————————————————————————————————————————————————————————————————————————————————————————————————
|    Инструменты                  |    Генераторы             |    Мануалы        |    Дополнительные модули  |
|—————————————————————————————————|———————————————————————————|———————————————————|———————————————————————————|
| [1] Поиск по номеру телефона    | [9] Пароль                | [14] Osint        | [17] Osint tools          |
| [2] Шифровщик текста            | [10] Электронная почта    | [15] Анонимность  | [18] Eye of God 0.2       |
| [3] Мой IP                      | [11] Пасспорт             | [16] Поиск по IP  | [19] Doska                |
| [4] Место по координатам        | [12] Личность             |                   |                           |
| [5] Поиск по нику               | [13] Банковская карта     |                   |                           |
| [6] Сокращение ссылки           |                           |                   |                           |
| [7] Поиск по телеграм           |                           |                   |                           |
| [8] Поиск ко IP                 |                           |                   |                           |
———————————————————————————————————————————————————————————————————————————————————————————————————————————————
"""

print(name)